#ifndef __TVT_TIME_ZONE_H__
#define __TVT_TIME_ZONE_H__

///////////////////////////////////////////////////////////////////////////////////////////
static char g_time_zone_info[][128]=
{
	"UTC+12:00:00",                                                //(UTC-12:00)国际日期变更线西
	"UTC+11:00:00",                                                //(UTC-11:00)协调世界时-11
	"UTC+10:00:00",                                                //(UTC-10:00)夏威夷
	"UTC+09:00:00UTC+08:00:00,M3.2.0/02:00:00,M11.1.0/02:00:00",   //(UTC-09:00)阿拉斯加
	"UTC+08:00:00UTC+07:00:00,M4.1.0/02:00:00,M10.5.0/02:00:00",   //(UTC-08:00)下加利福尼亚州
	"UTC+08:00:00UTC+07:00:00,M3.2.0/02:00:00,M11.1.0/02:00:00",   //(UTC-08:00)太平洋时间(美国和加拿大)
	"UTC+07:00:00",                                                //(UTC-07:00)亚利桑那
	"UTC+07:00:00UTC+06:00:00,M4.1.0/02:00:00,M10.5.0/02:00:00",   //(UTC-07:00)奇瓦瓦，拉巴斯，马萨特兰
	"UTC+07:00:00UTC+06:00:00,M3.2.0/02:00:00,M11.1.0/02:00:00",   //(UTC-07:00)山地时间(美国和加拿大)
	"UTC+06:00:00UTC+05:00:00,M4.1.0/02:00:00,M10.5.0/02:00:00",   //(UTC-06:00)瓜达拉哈拉，墨西哥城，蒙特雷
	"UTC+06:00:00UTC+05:00:00,M3.2.0/02:00:00,M11.1.0/02:00:00",   //(UTC-06:00)中部时间(美国和加拿大)
	"UTC+06:00:00",                                                //(UTC-06:00)中美洲，萨斯喀彻温
	"UTC+05:00:00UTC+04:00:00,M3.2.0/02:00:00,M11.1.0/02:00:00",   //(UTC-05:00)印地安那州(东部)
	"UTC+05:00:00",                                                //(UTC-05:00)波哥大，利马，基多
	"UTC+05:00:00UTC+04:00:00,M3.2.0/02:00:00,M11.1.0/02:00:00",   //(UTC-05:00)东部时间(美国和加拿大)
	"UTC+04:30:00",                                                //(UTC-04:30)加拉加斯
	"UTC+04:00:00",                                                //(UTC-04:00)乔治敦，拉巴斯，马瑙斯，圣胡安
	"UTC+04:00:00UTC+03:00:00,M10.1.6/23:59:59,M4.2.6/23:59:59",   //(UTC-04:00)亚松森
	"UTC+04:00:00UTC+03:00:00,M10.2.6/23:59:59,M3.2.6/23:59:59",   //(UTC-04:00)圣地亚哥
	"UTC+04:00:00UTC+03:00:00,M10.3.6/23:59:59,M2.3.6/23:59:59",   //(UTC-04:00)库亚巴
	"UTC+04:00:00UTC+03:00:00,M3.2.0/02:00:00,M11.1.0/02:00:00",   //(UTC-04:00)大西洋时间(加拿大)
	"UTC+03:30:00UTC+02:30:00,M3.2.0/02:00:00,M11.1.0/02:00:00",   //(UTC-03:30)纽芬兰
	"UTC+03:00:00",                                                //(UTC-03:00)卡宴，福塔雷萨，萨尔瓦多，布宜诺斯艾利斯
	"UTC+03:00:00UTC+02:00:00,M10.1.0/02:00:00,M3.2.0/02:00:00",   //(UTC-03:00)蒙得维的亚
	"UTC+03:00:00UTC+02:00:00,M3.5.6/22:00:00,M10.5.6/23:00:00",   //(UTC-03:00)格陵兰
	"UTC+03:00:00UTC+02:00:00,M10.3.6/23:59:59,M2.3.6/23:59:59",   //(UTC-03:00)巴西利亚
	"UTC+02:00:00",                                                //(UTC-02:00)协调世界时-02
	"UTC+02:00:00UTC+01:00:00,M3.5.0/02:00:00,M9.5.0/02:00:00",    //(UTC-02:00)中大西洋
	"UTC+01:00:00",                                                //(UTC-01:00)佛得角群岛
	"UTC+01:00:00UTC+00:00:00,M3.5.0/00:00:00,M10.5.0/01:00:00",   //(UTC-01:00)亚速尔群岛
	"UTC+00:00:00",                                                //(UTC)协调世界时，蒙罗维亚，雷克雅未克
	"UTC+00:00:00UTC-01:00:00,M3.5.0/02:00:00,M10.5.0/03:00:00",   //(UTC)卡萨布兰卡
	"UTC+00:00:00UTC-01:00:00,M3.5.0/01:00:00,M10.5.0/02:00:00",   //(UTC)都柏林，爱丁堡，里斯本，伦敦
	"UTC-01:00:00UTC-02:00:00,M3.5.0/02:00:00,M10.5.0/03:00:00",   //(UTC+01:00)阿姆斯特丹，柏林，伯尔尼，罗马，斯德哥尔摩，维也纳
	"UTC-01:00:00",                                                //(UTC+01:00)中非西部
	"UTC-01:00:00UTC-02:00:00,M3.5.0/02:00:00,M10.5.0/03:00:00",   //(UTC+01:00)布鲁塞尔，哥本哈根，马德里，巴黎
	"UTC-01:00:00UTC-02:00:00,M9.1.0/02:00:00,M4.1.0/02:00:00",    //(UTC+01:00)温得和克
	"UTC-01:00:00UTC-02:00:00,M3.5.0/02:00:00,M10.5.0/03:00:00",   //(UTC+01:00)萨拉热窝，斯科普里，华沙，萨格勒布
	"UTC-01:00:00UTC-02:00:00,M3.5.0/02:00:00,M10.5.0/03:00:00",   //(UTC+01:00)贝尔格莱德，布拉迪斯拉发，布达佩斯，卢布尔雅那，布拉格
	"UTC-02:00:00UTC-03:00:00,M3.5.0/03:00:00,M10.5.0/04:00:00",   //(UTC+02:00)伊斯坦布尔
	"UTC-02:00:00UTC-03:00:00,M4.1.4/23:59:59,M10.5.4/23:59:59",   //(UTC+02:00)大马士革
	"UTC-02:00:00",                                                //(UTC+02:00)哈拉雷，比勒陀利亚，的黎波里，开罗
	"UTC-02:00:00UTC-03:00:00,M3.5.6/23:59:59,M10.5.6/23:59:59",   //(UTC+02:00)贝鲁特
	"UTC-02:00:00UTC-03:00:00,M3.5.5/02:00:00,M10.5.0/02:00:00",   //(UTC+02:00)耶路撒冷
	"UTC-02:00:00UTC-03:00:00,M3.5.0/03:00:00,M10.5.0/04:00:00",   //(UTC+02:00)雅典，布加勒斯特
	"UTC-02:00:00UTC-03:00:00,M3.5.0/03:00:00,M10.5.0/04:00:00",   //(UTC+02:00)赫尔辛基，基辅，里加，索非亚，塔林，维尔纽斯
	"UTC-02:00:00UTC-03:00:00,M3.5.0/02:00:00,M10.5.0/03:00:00",   //(UTC+02:00)东欧
	"UTC-03:00:00",                                                //(UTC+03:00)加里宁格勒，明斯克，安曼，内罗毕，巴格达
	"UTC-03:00:00",                                                //(UTC+03:00)科威特，利雅得
	"UTC-03:30:00UTC-04:30:00,M3.3.6/23:59:59,M9.3.1/23:59:59",    //(UTC+03:30)德黑兰
	"UTC-04:00:00",                                                //(UTC+04:00)莫斯科，圣彼得堡，伏尔加格勒，路易港，埃里温
	"UTC-04:00:00",                                                //(UTC+04:00)第比利斯，阿布扎比，马斯喀特
	"UTC-04:00:00UTC-05:00:00,M3.5.0/04:00:00,M10.5.0/05:00:00",   //(UTC+04:00)巴库
	"UTC-04:30:00",                                                //(UTC+04:30)喀布尔
	"UTC-05:00:00",                                                //(UTC+05:00)阿什哈巴德，塔什干，伊斯兰堡，卡拉奇
	"UTC-05:30:00",                                                //(UTC+05:30)斯里加亚渥登普拉
	"UTC-05:30:00",                                                //(UTC+05:30)钦奈，加尔各答，孟买，新德里
	"UTC-05:45:00",                                                //(UTC+05:45)加德满都
	"UTC-06:00:00",                                                //(UTC+06:00)叶卡捷琳堡，阿斯塔纳，达卡
	"UTC-06:30:00",                                                //(UTC+06:30)仰光
	"UTC-07:00:00",                                                //(UTC+07:00)曼谷，河内，雅加达，新西伯利亚
	"UTC-08:00:00",                                                //(UTC+08:00)珀斯，乌兰巴托
	"UTC-08:00:00",                                                //(UTC+08:00)克拉斯诺亚尔斯克
	"UTC-08:00:00",                                                //(UTC+08:00)北京，台北，香港，吉隆坡，新加坡
	"UTC-09:00:00",                                                //(UTC+09:00)大阪，札幌，东京，伊尔库茨克，首尔
	"UTC-09:30:00UTC-10:30:00,M10.1.0/02:00:00,M4.1.0/03:00:00",   //(UTC+09:30)阿德莱德
	"UTC-09:30:00",                                                //(UTC+09:30)达尔文
	"UTC-10:00:00",                                                //(UTC+10:00)雅库茨克，关岛，莫尔兹比港，布里斯班
	"UTC-10:00:00UTC-11:00:00,M10.1.0/02:00:00,M4.1.0/03:00:00",   //(UTC+10:00)霍巴特
	"UTC-10:00:00UTC-11:00:00,M10.1.0/02:00:00,M4.1.0/03:00:00",   //(UTC+10:00)堪培拉，墨尔本，悉尼
	"UTC-11:00:00",                                                //(UTC+11:00)符拉迪沃斯托克，所罗门群岛，新喀里多尼亚
	"UTC-12:00:00",                                                //(UTC+12:00)协调世界时+12，马加丹
	"UTC-12:00:00UTC-13:00:00,M9.5.0/02:00:00,M4.1.0/03:00:00",    //(UTC+12:00)奥克兰，惠灵顿
	"UTC-12:00:00UTC-13:00:00,M3.5.0/02:00:00,M10.5.0/03:00:00",   //(UTC+12:00)彼得罗巴甫洛夫斯克-堪察加
	"UTC-12:00:00UTC-13:00:00,M10.4.0/02:00:00,M1.3.0/03:00:00",   //(UTC+12:00)斐济
	"UTC-13:00:00",                                                //(UTC+13:00)努库阿洛法
	"UTC-13:00:00UTC-14:00:00,M9.5.0/00:00:00,M4.1.0/01:00:00",    //(UTC+13:00)萨摩亚群岛
};

/////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////
typedef enum _tvt_time_zone_
{
	TVT_TZ_DATELINE_STANDARD_TIME,                                 //(UTC-12:00)国际日期变更线西
	TVT_TZ_UTC_DEC_11,                                             //(UTC-11:00)协调世界时-11
	TVT_TZ_HAWAIIAN_STANDARD_TIME,                                 //(UTC-10:00)夏威夷
	TVT_TZ_ALASKAN_STANDARD_TIME,                                  //(UTC-09:00)阿拉斯加
	TVT_TZ_PACIFIC_STANDARD_TIME_MEXICO,                           //(UTC-08:00)下加利福尼亚州
	TVT_TZ_PACIFIC_STANDARD_TIME,                                  //(UTC-08:00)太平洋时间(美国和加拿大)
	TVT_TZ_US_MOUNTAIN_STANDARD_TIME,                              //(UTC-07:00)亚利桑那
	TVT_TZ_MOUNTAIN_STANDARD_TIME_MEXICO,                          //(UTC-07:00)奇瓦瓦，拉巴斯，马萨特兰
	TVT_TZ_MOUNTAIN_STANDARD_TIME,                                 //(UTC-07:00)山地时间(美国和加拿大)
	TVT_TZ_CENTRAL_STANDARD_TIME_MEXICO,                           //(UTC-06:00)瓜达拉哈拉，墨西哥城，蒙特雷
	TVT_TZ_CENTRAL_STANDARD_TIME,                                  //(UTC-06:00)中部时间(美国和加拿大)
	TVT_TZ_CENTRAL_AMERICA_STANDARD_TIME,                          //(UTC-06:00)中美洲，萨斯喀彻温
	TVT_TZ_US_EASTERN_STANDARD_TIME,                               //(UTC-05:00)印地安那州(东部)
	TVT_TZ_SA_PACIFIC_STANDARD_TIME,                               //(UTC-05:00)波哥大，利马，基多
	TVT_TZ_EASTERN_STANDARD_TIME,                                  //(UTC-05:00)东部时间(美国和加拿大)
	TVT_TZ_VENEZUELA_STANDARD_TIME,                                //(UTC-04:30)加拉加斯
	TVT_TZ_SA_WESTERN_STANDARD_TIME,                               //(UTC-04:00)乔治敦，拉巴斯，马瑙斯，圣胡安
	TVT_TZ_PARAGUAY_STANDARD_TIME,                                 //(UTC-04:00)亚松森
	TVT_TZ_PACIFIC_SA_STANDARD_TIME,                               //(UTC-04:00)圣地亚哥
	TVT_TZ_CENTRAL_BRAZILIAN_STANDARD_TIME,                        //(UTC-04:00)库亚巴
	TVT_TZ_ATLANTIC_STANDARD_TIME,                                 //(UTC-04:00)大西洋时间(加拿大)
	TVT_TZ_NEWFOUNDLAND_STANDARD_TIME,                             //(UTC-03:30)纽芬兰
	TVT_TZ_SA_EASTERN_STANDARD_TIME,                               //(UTC-03:00)卡宴，福塔雷萨，萨尔瓦多，布宜诺斯艾利斯
	TVT_TZ_MONTEVIDEO_STANDARD_TIME,                               //(UTC-03:00)蒙得维的亚
	TVT_TZ_GREENLAND_STANDARD_TIME,                                //(UTC-03:00)格陵兰
	TVT_TZ_E_SOUTH_AMERICA_STANDARD_TIME,                          //(UTC-03:00)巴西利亚
	TVT_TZ_UTC_DEC_02,                                             //(UTC-02:00)协调世界时-02
	TVT_TZ_MID_DEC_ATLANTIC_STANDARD_TIME,                         //(UTC-02:00)中大西洋
	TVT_TZ_CAPE_VERDE_STANDARD_TIME,                               //(UTC-01:00)佛得角群岛
	TVT_TZ_AZORES_STANDARD_TIME,                                   //(UTC-01:00)亚速尔群岛
	TVT_TZ_UTC,                                                    //(UTC)协调世界时，蒙罗维亚，雷克雅未克
	TVT_TZ_MOROCCO_STANDARD_TIME,                                  //(UTC)卡萨布兰卡
	TVT_TZ_GMT_STANDARD_TIME,                                      //(UTC)都柏林，爱丁堡，里斯本，伦敦
	TVT_TZ_W_EUROPE_STANDARD_TIME,                                 //(UTC+01:00)阿姆斯特丹，柏林，伯尔尼，罗马，斯德哥尔摩，维也纳
	TVT_TZ_W_CENTRAL_AFRICA_STANDARD_TIME,                         //(UTC+01:00)中非西部
	TVT_TZ_ROMANCE_STANDARD_TIME,                                  //(UTC+01:00)布鲁塞尔，哥本哈根，马德里，巴黎
	TVT_TZ_NAMIBIA_STANDARD_TIME,                                  //(UTC+01:00)温得和克
	TVT_TZ_CENTRAL_EUROPEAN_STANDARD_TIME,                         //(UTC+01:00)萨拉热窝，斯科普里，华沙，萨格勒布
	TVT_TZ_CENTRAL_EUROPE_STANDARD_TIME,                           //(UTC+01:00)贝尔格莱德，布拉迪斯拉发，布达佩斯，卢布尔雅那，布拉格
	TVT_TZ_TURKEY_STANDARD_TIME,                                   //(UTC+02:00)伊斯坦布尔
	TVT_TZ_SYRIA_STANDARD_TIME,                                    //(UTC+02:00)大马士革
	TVT_TZ_SOUTH_AFRICA_STANDARD_TIME,                             //(UTC+02:00)哈拉雷，比勒陀利亚，的黎波里，开罗
	TVT_TZ_MIDDLE_EAST_STANDARD_TIME,                              //(UTC+02:00)贝鲁特
	TVT_TZ_ISRAEL_STANDARD_TIME,                                   //(UTC+02:00)耶路撒冷
	TVT_TZ_GTB_STANDARD_TIME,                                      //(UTC+02:00)雅典，布加勒斯特
	TVT_TZ_FLE_STANDARD_TIME,                                      //(UTC+02:00)赫尔辛基，基辅，里加，索非亚，塔林，维尔纽斯
	TVT_TZ_E_EUROPE_STANDARD_TIME,                                 //(UTC+02:00)东欧
	TVT_TZ_KALININGRAD_STANDARD_TIME,                              //(UTC+03:00)加里宁格勒，明斯克，安曼，内罗毕，巴格达
	TVT_TZ_ARAB_STANDARD_TIME,                                     //(UTC+03:00)科威特，利雅得
	TVT_TZ_IRAN_STANDARD_TIME,                                     //(UTC+03:30)德黑兰
	TVT_TZ_RUSSIAN_STANDARD_TIME,                                  //(UTC+04:00)莫斯科，圣彼得堡，伏尔加格勒，路易港，埃里温
	TVT_TZ_GEORGIAN_STANDARD_TIME,                                 //(UTC+04:00)第比利斯，阿布扎比，马斯喀特
	TVT_TZ_AZERBAIJAN_STANDARD_TIME,                               //(UTC+04:00)巴库
	TVT_TZ_AFGHANISTAN_STANDARD_TIME,                              //(UTC+04:30)喀布尔
	TVT_TZ_WEST_ASIA_STANDARD_TIME,                                //(UTC+05:00)阿什哈巴德，塔什干，伊斯兰堡，卡拉奇
	TVT_TZ_SRI_LANKA_STANDARD_TIME,                                //(UTC+05:30)斯里加亚渥登普拉
	TVT_TZ_INDIA_STANDARD_TIME,                                    //(UTC+05:30)钦奈，加尔各答，孟买，新德里
	TVT_TZ_NEPAL_STANDARD_TIME,                                    //(UTC+05:45)加德满都
	TVT_TZ_EKATERINBURG_STANDARD_TIME,                             //(UTC+06:00)叶卡捷琳堡，阿斯塔纳，达卡
	TVT_TZ_MYANMAR_STANDARD_TIME,                                  //(UTC+06:30)仰光
	TVT_TZ_SE_ASIA_STANDARD_TIME,                                  //(UTC+07:00)曼谷，河内，雅加达，新西伯利亚
	TVT_TZ_W_AUSTRALIA_STANDARD_TIME,                              //(UTC+08:00)珀斯，乌兰巴托
	TVT_TZ_NORTH_ASIA_STANDARD_TIME,                               //(UTC+08:00)克拉斯诺亚尔斯克
	TVT_TZ_CHINA_STANDARD_TIME,                                    //(UTC+08:00)北京，台北，香港，吉隆坡，新加坡
	TVT_TZ_TOKYO_STANDARD_TIME,                                    //(UTC+09:00)大阪，札幌，东京，伊尔库茨克，首尔
	TVT_TZ_CEN_AUSTRALIA_STANDARD_TIME,                            //(UTC+09:30)阿德莱德
	TVT_TZ_AUS_CENTRAL_STANDARD_TIME,                              //(UTC+09:30)达尔文
	TVT_TZ_YAKUTSK_STANDARD_TIME,                                  //(UTC+10:00)雅库茨克，关岛，莫尔兹比港，布里斯班
	TVT_TZ_TASMANIA_STANDARD_TIME,                                 //(UTC+10:00)霍巴特
	TVT_TZ_AUS_EASTERN_STANDARD_TIME,                              //(UTC+10:00)堪培拉，墨尔本，悉尼
	TVT_TZ_VLADIVOSTOK_STANDARD_TIME,                              //(UTC+11:00)符拉迪沃斯托克，所罗门群岛，新喀里多尼亚
	TVT_TZ_UTC_ADD_12,                                             //(UTC+12:00)协调世界时+12，马加丹
	TVT_TZ_NEW_ZEALAND_STANDARD_TIME,                              //(UTC+12:00)奥克兰，惠灵顿
	TVT_TZ_KAMCHATKA_STANDARD_TIME,                                //(UTC+12:00)彼得罗巴甫洛夫斯克-堪察加
	TVT_TZ_FIJI_STANDARD_TIME,                                     //(UTC+12:00)斐济
	TVT_TZ_TONGA_STANDARD_TIME,                                    //(UTC+13:00)努库阿洛法
	TVT_TZ_SAMOA_STANDARD_TIME,                                    //(UTC+13:00)萨摩亚群岛
}TVT_TIME_ZONE;

/////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////

/* for js
var tz=(
	"UTC+12:00:00",
	"UTC+11:00:00",
	"UTC+10:00:00",
	"UTC+09:00:00UTC+08:00:00,M3.2.0/02:00:00,M11.1.0/02:00:00",
	"UTC+08:00:00UTC+07:00:00,M4.1.0/02:00:00,M10.5.0/02:00:00",
	"UTC+08:00:00UTC+07:00:00,M3.2.0/02:00:00,M11.1.0/02:00:00",
	"UTC+07:00:00",
	"UTC+07:00:00UTC+06:00:00,M4.1.0/02:00:00,M10.5.0/02:00:00",
	"UTC+07:00:00UTC+06:00:00,M3.2.0/02:00:00,M11.1.0/02:00:00",
	"UTC+06:00:00UTC+05:00:00,M4.1.0/02:00:00,M10.5.0/02:00:00",
	"UTC+06:00:00UTC+05:00:00,M3.2.0/02:00:00,M11.1.0/02:00:00",
	"UTC+06:00:00",
	"UTC+05:00:00UTC+04:00:00,M3.2.0/02:00:00,M11.1.0/02:00:00",
	"UTC+05:00:00",
	"UTC+05:00:00UTC+04:00:00,M3.2.0/02:00:00,M11.1.0/02:00:00",
	"UTC+04:30:00",
	"UTC+04:00:00",
	"UTC+04:00:00UTC+03:00:00,M10.1.6/23:59:59,M4.2.6/23:59:59",
	"UTC+04:00:00UTC+03:00:00,M10.2.6/23:59:59,M3.2.6/23:59:59",
	"UTC+04:00:00UTC+03:00:00,M10.3.6/23:59:59,M2.3.6/23:59:59",
	"UTC+04:00:00UTC+03:00:00,M3.2.0/02:00:00,M11.1.0/02:00:00",
	"UTC+03:30:00UTC+02:30:00,M3.2.0/02:00:00,M11.1.0/02:00:00",
	"UTC+03:00:00",
	"UTC+03:00:00UTC+02:00:00,M10.1.0/02:00:00,M3.2.0/02:00:00",
	"UTC+03:00:00UTC+02:00:00,M3.5.6/22:00:00,M10.5.6/23:00:00",
	"UTC+03:00:00UTC+02:00:00,M10.3.6/23:59:59,M2.3.6/23:59:59",
	"UTC+02:00:00",
	"UTC+02:00:00UTC+01:00:00,M3.5.0/02:00:00,M9.5.0/02:00:00",
	"UTC+01:00:00",
	"UTC+01:00:00UTC+00:00:00,M3.5.0/00:00:00,M10.5.0/01:00:00",
	"UTC+00:00:00",
	"UTC+00:00:00UTC-01:00:00,M3.5.0/02:00:00,M10.5.0/03:00:00",
	"UTC+00:00:00UTC-01:00:00,M3.5.0/01:00:00,M10.5.0/02:00:00",
	"UTC-01:00:00UTC-02:00:00,M3.5.0/02:00:00,M10.5.0/03:00:00",
	"UTC-01:00:00",
	"UTC-01:00:00UTC-02:00:00,M3.5.0/02:00:00,M10.5.0/03:00:00",
	"UTC-01:00:00UTC-02:00:00,M9.1.0/02:00:00,M4.1.0/02:00:00",
	"UTC-01:00:00UTC-02:00:00,M3.5.0/02:00:00,M10.5.0/03:00:00",
	"UTC-01:00:00UTC-02:00:00,M3.5.0/02:00:00,M10.5.0/03:00:00",
	"UTC-02:00:00UTC-03:00:00,M3.5.0/03:00:00,M10.5.0/04:00:00",
	"UTC-02:00:00UTC-03:00:00,M4.1.4/23:59:59,M10.5.4/23:59:59",
	"UTC-02:00:00",
	"UTC-02:00:00UTC-03:00:00,M3.5.6/23:59:59,M10.5.6/23:59:59",
	"UTC-02:00:00UTC-03:00:00,M3.5.5/02:00:00,M10.5.0/02:00:00",
	"UTC-02:00:00UTC-03:00:00,M3.5.0/03:00:00,M10.5.0/04:00:00",
	"UTC-02:00:00UTC-03:00:00,M3.5.0/03:00:00,M10.5.0/04:00:00",
	"UTC-02:00:00UTC-03:00:00,M3.5.0/02:00:00,M10.5.0/03:00:00",
	"UTC-03:00:00",
	"UTC-03:00:00",
	"UTC-03:30:00UTC-04:30:00,M3.3.6/23:59:59,M9.3.1/23:59:59",
	"UTC-04:00:00",
	"UTC-04:00:00",
	"UTC-04:00:00UTC-05:00:00,M3.5.0/04:00:00,M10.5.0/05:00:00",
	"UTC-04:30:00",
	"UTC-05:00:00",
	"UTC-05:30:00",
	"UTC-05:30:00",
	"UTC-05:45:00",
	"UTC-06:00:00",
	"UTC-06:30:00",
	"UTC-07:00:00",
	"UTC-08:00:00",
	"UTC-08:00:00",
	"UTC-08:00:00",
	"UTC-09:00:00",
	"UTC-09:30:00UTC-10:30:00,M10.1.0/02:00:00,M4.1.0/03:00:00",
	"UTC-09:30:00",
	"UTC-10:00:00",
	"UTC-10:00:00UTC-11:00:00,M10.1.0/02:00:00,M4.1.0/03:00:00",
	"UTC-10:00:00UTC-11:00:00,M10.1.0/02:00:00,M4.1.0/03:00:00",
	"UTC-11:00:00",
	"UTC-12:00:00",
	"UTC-12:00:00UTC-13:00:00,M9.5.0/02:00:00,M4.1.0/03:00:00",
	"UTC-12:00:00UTC-13:00:00,M3.5.0/02:00:00,M10.5.0/03:00:00",
	"UTC-12:00:00UTC-13:00:00,M10.4.0/02:00:00,M1.3.0/03:00:00",
	"UTC-13:00:00",
	"UTC-13:00:00UTC-14:00:00,M9.5.0/00:00:00,M4.1.0/01:00:00",
);
*/

/////////////////////////////////////////////////////////////////////////////////////////
#endif

